---
title: FailuresProcessingEventArgs
classe: Autodesk.Revit.DB.Events.FailuresProcessingEventArgs
namespace: Autodesk.Revit.DB.Events
eredita: Autodesk.Revit.DB.Events.RevitAPISingleEventArgs
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# FailuresProcessingEventArgs

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailuresAccessor GetFailuresAccessor()` | `failuresProcessingEventArgs.GetFailuresAccessor()` | FailuresAccessor |
| `FailureProcessingResult GetProcessingResult()` | `failuresProcessingEventArgs.GetProcessingResult()` | FailureProcessingResult |
| `Void SetProcessingResult(FailureProcessingResult)` | `failuresProcessingEventArgs.SetProcessingResult(result)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```